import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

// var allCompitition = [
//   {
//     "numberRacerRest": 88,
//     "subTitle": "عدد المتسابقين المتبقي",
//     "nameCompitition": "مسابقة المتجر الذهبي",
//     "ImageCap": "assets/images/trophy.png",
//     "mony": 300,
//     "subscribeMony": 55,
//     "totalRacer": 44,
//     "description":
//         "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق."
//   },
//   {
//     "numberRacerRest": 11,
//     "subTitle": "عدد المتسابقين المتبقي",
//     "nameCompitition": "مسابقة المتجر الذهبي",
//     "ImageCap": "assets/images/trophy.png",
//     "mony": 600,
//     "subscribeMony": 54,
//     "totalRacer": 66,
//     "description":
//         "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق."
//   },
//   {
//     "numberRacerRest": 22,
//     "subTitle": "عدد المتسابقين المتبقي",
//     "nameCompitition": "مسابقة المتجر الذهبي",
//     "ImageCap": "assets/images/trophy.png",
//     "mony": 66,
//     "subscribeMony": 88,
//     "totalRacer": 99,
//     "description":
//         "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق."
//   },
//   {
//     "numberRacerRest": 22,
//     "subTitle": "عدد المتسابقين المتبقي",
//     "nameCompitition": "مسابقة المتجر الذهبي",
//     "ImageCap": "assets/images/trophy.png",
//     "mony": 66,
//     "subscribeMony": 88,
//     "totalRacer": 99,
//     "description":
//         "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق."
//   },
//   {
//     "numberRacerRest": 22,
//     "subTitle": "عدد المتسابقين المتبقي",
//     "nameCompitition": "مسابقة المتجر الذهبي",
//     "ImageCap": "assets/images/trophy.png",
//     "mony": 66,
//     "subscribeMony": 88,
//     "totalRacer": 99,
//     "description":
//         "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق."
//   },
//   {
//     "numberRacerRest": 22,
//     "subTitle": "عدد المتسابقين المتبقي",
//     "nameCompitition": "مسابقة المتجر الذهبي",
//     "ImageCap": "assets/images/trophy.png",
//     "mony": 66,
//     "subscribeMony": 88,
//     "totalRacer": 99,
//     "description":
//         "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق."
//   },
//   {
//     "numberRacerRest": 22,
//     "subTitle": "عدد المتسابقين المتبقي",
//     "nameCompitition": "مسابقة المتجر الذهبي",
//     "ImageCap": "assets/images/trophy.png",
//     "mony": 66,
//     "subscribeMony": 88,
//     "totalRacer": 99,
//     "description":
//         "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق."
//   },
//   {
//     "numberRacerRest": 22,
//     "subTitle": "عدد المتسابقين المتبقي",
//     "nameCompitition": "مسابقة المتجر الذهبي",
//     "ImageCap": "assets/images/trophy.png",
//     "mony": 66,
//     "subscribeMony": 88,
//     "totalRacer": 99,
//     "description":
//         "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق."
//   },
// ];
